# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [23]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [24]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [25]:
# Your code here:
nan_cols=salaries.isna().sum()
nan_cols[nan_cols>0]

Typical Hours    25161
Annual Salary     8022
Hourly Rate      25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [26]:
# Your code here:
salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [27]:
# Your code here:
df_count= salaries.groupby(['Department'])['Name'].agg('count')
df_count

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [31]:
salaries_h = salaries[salaries['Salary or Hourly']=='Hourly']
salaries_h.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

In [33]:
# Your code here:
from scipy.stats import t

In [35]:
salaries_h.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    8022.000000            0.0  8022.000000
mean       34.507604            NaN    32.788558
std         9.252077            NaN    12.112573
min        10.000000            NaN     2.650000
25%        20.000000            NaN    21.200000
50%        40.000000            NaN    35.600000
75%        40.000000            NaN    40.200000
max        40.000000            NaN   109.000000

In [36]:
salaries_h.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8022 entries, 4 to 33175
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               8022 non-null   object
 1   Job Titles         8022 non-null   object
 2   Department         8022 non-null   object
 3   Full or Part-Time  8022 non-null   object
 4   Salary or Hourly   8022 non-null   object
 5   Typical Hours      8022 non-null   float64
 6   Annual Salary      0 non-null      float64
 7   Hourly Rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 564.0+ KB

In [37]:
# Your code here:

mu=30   # media poblacional

mu_hat=32.788558   # media muestral, media del estudio

std_hat=12.112573  # std muestra, std del estudio

n=8022    # tamaño de la muestra

In [38]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))

t_test

20.61980734597066

In [39]:
dof=n-1  # grados de libertad

dof

8021

In [43]:
p_value=(t(df=dof).cdf(t_test)/2)

p_value

0.5

No se puede rechazar H0. No hay diferencia significativa

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [67]:
salaries_pol = salaries[salaries['Salary or Hourly']=='Salary']
salaries_pol_ = salaries_pol[salaries_pol['Department'].str.contains('POLICE')]

salaries_pol_.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [68]:
salaries_pol_.describe()

       Typical Hours  Annual Salary  Hourly Rate
count            0.0   13406.000000          0.0
mean             NaN   86486.362226          NaN
std              NaN   18272.443068          NaN
min              NaN   38376.000000          NaN
25%              NaN   84054.000000          NaN
50%              NaN   90024.000000          NaN
75%              NaN   94524.000000          NaN
max              NaN  260004.000000          NaN

In [71]:
mu=86000   # media poblacional

mu_hat=86486.362226  # media muestral, media del estudio

std_hat=18272.443068  # std muestra, std del estudio

n=13406    # tamaño de la muestra

In [72]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))

t_test

3.081859443066299

In [73]:
p_value=1-(t(df=13405).cdf(t_test))

p_value

0.0010306456979468637

Se puede rechazar  H0. Si están por encima de los 86000 € anuales

Using the `crosstab` function, find the department that has the most hourly workers.

In [90]:
# Your code here:
cross = pd.crosstab(salaries['Department'], salaries['Salary or Hourly'])

cross.sort_values('Hourly', ascending=False).head(1)

Salary or Hourly  Hourly  Salary
Department
STREETS & SAN       1862     336

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [95]:
# Your code here:
salaries_streets_san = salaries_h[salaries_h['Department']=='STREETS & SAN']
salaries_streets_san.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    1862.000000            0.0  1862.000000
mean       37.137487            NaN    33.728378
std         8.777897            NaN     5.735242
min        10.000000            NaN    19.500000
25%        40.000000            NaN    35.600000
50%        40.000000            NaN    35.600000
75%        40.000000            NaN    36.210000
max        40.000000            NaN    53.100000

In [99]:
mu=35   # media poblacional

mu_hat=33.728378  # media muestral, media del estudio

std_hat=5.735242  # std muestra, std del estudio

n=1862    # tamaño de la muestra

In [100]:
t_test = (mu_hat - mu) / (std_hat/np.sqrt(n))

t_test

-9.567448286050341

In [101]:
p_value=(t(df=13405).cdf(t_test))

p_value

6.422668660484905e-22

Al ser p value cercano a 0, se puede rechazar la H0 (que > 35$/h) por lo que si se puede afirmar 
que los salarios hourly sean menores a 35$/h

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [108]:
import scipy.stats as st

In [106]:
# Your code here:
data = salaries[salaries['Salary or Hourly']=='Hourly']['Hourly Rate']

In [111]:
intervalo = st.t.interval(alpha=0.95,df=len(data)-1,loc=np.mean(data), scale=st.sem(data))
intervalo

(32.52345834488529, 33.05365708767727)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [114]:
# Your code here:
salaries_pol_v2 = salaries[salaries['Department'].str.contains('POLICE')]
pol = salaries_pol_v2[salaries_pol_v2['Salary or Hourly']=='Salary']['Annual Salary']

In [115]:
intervalo = st.t.interval(alpha=0.95,df=len(pol)-1,loc=np.mean(pol), scale=st.sem(pol))
intervalo

(86177.02348322631, 86795.70096851172)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [119]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest

In [136]:
muestra = salaries['Salary or Hourly'].value_counts()
muestr = muestra[1]
lon = len(salaries)

In [135]:
zvalue, pvalue = proportions_ztest(muestr, lon, 0.25)

print ('z value is ', zvalue)
print ('p-value is ', pvalue)

z value is  -3.5099964213703005
p-value is  0.0004481127249057967